Repository: AboutaraDev/Human-Resources-Management-System
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: edit_intern_save/
fr: modifier_employé_enregistrer/

source: delete_intern/<intern_id>/
fr: supprimer_employé/<intern_id>/

source: generate_intern_pdf/
fr: gérer_employé_pdf/

source: manage_headquarter/
fr: gerer_mission/

source: add_headquarter/
fr: ajouter_mission/

source: add_headquarter_save/
fr: ajouter_mission_enregistrer/

source: edit_headquarter/<headquarter_id>
fr: modifier_mission/<headquarter_id>

source: edit_headquarter_save/
fr: modifier_mission_enregistrer/

source: delete_headquarter/<headquarter_id>/
fr: supprimer_mission/<headquarter_id>/

source: generate_assignment_pdf/
fr: générer_mission_pdf/

source: intern_feedback_message/
fr: message_employe/

source: intern_feedback_message_reply/
fr: réponse_au_message_employé/

source: staff_feedback_message/
fr: message_équipe/

source: staff_feedback_message_reply/
fr: réponse_au_message_équipe/

source: intern_leave_view/
fr: voir_congé_employé/

source: intern_leave_approve/<leave_id>/
fr: ajouter_employé_enregistrer/<leave_id>/

source: intern_leave_reject/<leave_id>/
fr: refus_congé_employé/<leave_id>/

source: staff_leave_view/
fr: voir_équipe_congé/

source: staff_leave_approve/<leave_id>/
fr: congé_du_équipe_approuver/<leave_id>/

source: staff_leave_reject/<leave_id>/
fr: équipe_congé_employé/<leave_id>/

source: admin_view_attendance/
fr: afficher_la_présence

source: admin_get_attendance_dates/
fr: obtenir_les_dates_de_présence_administrateur/

source: admin_get_attendance_intern/
fr: obtenir_les_dates_de_présence_stagiaire/

source: generate_admin_view_attendance/
fr: générer_admin_voir_présence/

source: generate_messages_staff/
fr: générer_messages_équipe/

source: generate_leaves_staffs/
fr: générer_congés_équipes/

source: generate_admin_view_leave_employee/
fr: générer_admin_voir_congé_employé/

source: generate_view_admin_message_employees/
fr: générer_voir_admin_message_employés/

source: staff_home/
fr: accueil_équipe/

source: staff_take_attendance/
fr: équipe_prendre_présence/

source: get_interns/
fr: obtenir_employés/

source: save_attendance_data/
fr: sauvgarder_données_de_présence/

source: staff_update_attendance/
fr: équipe_modifier_présence

source: get_attendance_dates/
fr: obtenir_les_dates_de_présence/

source: get_attendance_intern/
fr: obtenir_la_présence_de_employé/

source: update_attendance_data/
fr: modifier_les_données_de_présence/

source: staff_apply_leave/
fr: équipe_demande_congé/

source: staff_apply_leave_save/
fr: enregistrer_équipe_demande_congé/

source: staff_feedback_save/
fr: sauvgarder_message_équipe/

source: staff_profile/
fr: profile_équipe/

source: staff_profile_update/
fr: miseAjour_profile_aquipe/

source: staff_add_result/
fr: ajouter_resultat_équipe/

source: staff_add_result_save/
fr: ajouter_equipe_enregistrer_resultat/

source: view_headquarter/
fr: voir_mission/

source: view_intern/
fr: voir_employé/

source: intern_view_result_by_staff/
fr: voir_resultat_employé_par_équipe/

source: generate_employee_under_staff/
fr: générer_employé_sous_équipe/

source: generate_assignments_staff/
fr: générer_missions_équipe/

source: generate_attendance_employee_under_staff/
fr: générer_présence_employé_sous_équipe/

source: generate_result_employee_under_staff/
fr: générer_resultat_employé_sous_équipe/

source: generate_leave_staff/
fr: générer_congés_équipe/

source: generate_message_staff/
fr: gérérer_message_équipe/

source: intern_home/
fr: accueil_employé/

source: intern_view_attendance/
fr: voir_la_présence_employé/

source: intern_view_attendance_post/
fr: voir_la_présence_stagiaire_post/

source: intern_apply_leave/
fr: employé_postuler_congé/

source: intern_apply_leave_save/
fr: enregistrer_stagiaire_postuler_congé/

source: intern_feedback/
fr: message_employé/

source: intern_feedback_save/
fr: enregistrer_message_employé/

source: intern_profile/
fr: profile_employé/

source: intern_profile_update/
fr: miseAjour_profile_employé/

source: intern_view_result/
fr: voir_resultat_employé/

source: intern_view_headquarters/
fr: voir_missions_employé/

source: generate_attendance_employee/
fr: générer_présence_employé/

source: generate_result_employee/
fr: générer_resultat_employé/

source: generate_message_employee/
fr: générer_message_employé/

source: generate_leave_employee/
fr: générer_congé_employé/

source: check_email_exist/
fr: vérifier_email_existe/

source: check_username_exist/
fr: vérifier_nom_utilisateur_exist/

source: Invalid Login!
ar: تسجيل الدخول غير صالح!
fr: Identifiant Invalide!

source: Invalid Login Credentials!
ar: اعتماد تسجيل الدخول غير صالح!
fr: Authentification Invalide!

source: Please Login First
ar: الرجاء تسجيل الدخول أولا
fr: Si il vous plait Se Connecter D'abord

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: arabe

source: admin/
ar: مسؤول/
fr: administrateur/

source: Internship Period added Successfully!
ar: تمت إضافة فترة التدريب بنجاح !

source: Failed to Add Internship Period
ar: فشل إضافة فترة التدريب !

source: Internship Period Updated Successfully.
ar: تم تحديث فترة التدريب بنجاح!

source: Internship Period Deleted Successfully.
ar: تم حذف فترة التدريب بنجاح.

source: Failed to Delete Internship Period.
ar: فشل في حذف فترة التدريب.

source: Intern Added Successfully!
ar: تمت إضافة المتدرب بنجاح!

source: Failed to Add Intern!
ar: فشل إضافة المتدرب!

source: Intern Updated Successfully!
ar: تم تحديث المتدرب بنجاح!

source: Failed to Update Intern.
ar: فشل في تحديث المتدرب.

source: Intern Deleted Successfully.
ar: تم حذف المتدرب بنجاح.

source: Failed to Delete Intern.
ar: فشل في حذف المتدرب.

source: True
ar: صحيح

source: False
ar: خطأ

source: Feedback Sent.
ar: تم إرسال التعليق.

source: Failed to Send Feedback.
ar: فشل في إرسال التعليق!

source: Email
ar: بريد إلكتروني

source: message
ar: رسالة

source: Intern Management System | Dashboard
ar: نظام إدارة المتدربين | لوحة القيادة

source: Add Intern
ar: إضافة متدرب

source: Add Internship Period Year
ar: أضف سنة فترة التدريب

source: Add Internship Period
ar: أضف فترة التدريب

source: Absent
ar: غائب

source: Intern Management System | Admin Dashboard
ar: نظام إدارة المتدربين | لوحة تحكم المسؤول

source: Intern Management System | Admin
ar: نظام إدارة المتدربين | المسؤول

source: Edit Intern | Username: %(usern)s | #ID : %(idU)s
ar: تحرير المتدرب | اسم المستخدم: %(usern)s | #ID : %(idU)s

source: Edit Intern
ar: تحرير المتدرب

source: Update Intern
ar: تحديث المتدرب

source: Copyright
ar: حقوق النشر

source: Province Zagora
ar: عمالة زاكورة

source: Version
ar: إصدار

source: Total Interns
ar: إجمالي المتدربين

source: Intern and Staff Chart
ar: مبيان المتدربين و طاقم عمل

source: Total Interns in Each Department
ar: إجمالي المتدربين في كل قسم

source: Total Interns in Each Assignment
ar: إجمالي المتدربين في كل مهمة

source: Intern Attendance vs Leave
ar: الحضور المتدرب مقابل المغادرة

source: Interns
ar: المتدربين

source: Intern Feedback
ar: تعليقات المتدربين

source: Intern
ar: المتدرب

source: Intern Name
ar: اسم المتدرب

source: Intern Period
ar: فترة التدريب للمتدرب

source: Message
ar: رسالة

source: Reply Feedback
ar: الرد على التعليق

source: Error in Sending Feedback Reply.
ar: خطأ في إرسال رد التعليقات.

source: Leave Apply by Interns
ar: طلبات المغادرة للمتدربين

source: Leave Apply by interns
ar: طلبات المغادرة للمتدربين

source: Action
ar: فعل

source: Department Details
ar: تفاصيل القسم

source: Manage Intern
ar: إدارة المتدرب

source: + Add Intern
ar: + اضافة متدرب

source: Intern Details
ar: تفاصيل المتدرب

source: Manage Internship Period
ar: إدارة فترة التدريب

source: Staff Feedback
ar: تعليقات طاقم العمل

source: Intern Leave
ar: مغادرة المتدرب

source: Intern Management System | Intern Dashboard
ar: نظام إدارة المتدربين | لوحة القيادة للمتدرب

source: Status
ar: حالة

source: View Attendance Data
ar: عرض بيانات الحضور

source: Date :
ar: تاريخ :

source: Leave a Feedback Message
ar: اترك رسالة التعليق

source: Leave a Feedback
ar: اترك تعليق

source: Feedback History
ar: سجل التعليقات السابقة

source: Feedback Reply
ar: رد على التعليقات

source: Intern Home
ar: الصفحة الرئيسية للمتدرب

source: ABSENT
ar: غائب

source: Start Internship Date
ar: تاريخ بدء التدريب

source: End Internship Date
ar: تاريخ نهاية التدريب

source: Send Feedback
ar: إرسال تعليق

source: Sign in to Intern Management System
ar: قم بتسجيل الدخول إلى نظام إدارة المتدربين

source: Fetch Intern
ar: جلب المتدرب

source: Intern List
ar: قائمة المتدربين

source: Intern Management System | Staff Dashboard
ar: نظام إدارة المتدربين | لوحة القيادة لطاقم عمل

source: status
ar: حالة

source: Ammazing Work
ar: عمل مدهش

source: Wondurful Work
ar: عمل رائع

source: View Intern
ar: عرض المتدرب

source: Feedback
ar: تعليق

source: Interns Under Me
ar: المتدربون تحت إشرافي

source: Intern Attendance Data
ar: بيانات الحضور للمتدرب

source: Intern Attendance Chart for Present
ar: مبيان الحضور للمتدرب للحاضرين

source: Intern Attendance Chart for Absent
ar: مبيان الحضور للمتدرب للغائبين

source: Error in Saving Interns Attendance Data.
ar: خطأ في حفظ بيانات حضور المتدربين.
