Repository: AboutaraDev/Human-Resources-Management-System
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: Invalid Method
ar: طريقة غير صحيحة
fr: Identifiant Invalide!

source: Staff Added Successfully!
ar: تمت إضافة طاقم عمل بنجاح!
fr: Équipe ajouté avec succès !

source: Failed to Add Staff!
ar: فشل في إضافة طاقم العمل!
fr: Échec d'ajouter d'Équipe!

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Address
ar: عنوان
fr: Adresse

source: Staffs Details
fr: Détails d'Équipes

source: <h2>Method Not Allowed</h2>
ar: <h2>الطريقة غير متاحة</h2>
fr: <h2>Méthode Non Autorisée</h2>

source: Staff Updated Successfully.
ar: تم تحديث طاقم عمل بنجاح.
fr: Équipe mis à jour avec succès.

source: Failed to Update Staff.
ar: فشل في تحديث طاقم عمل.
fr: Échec de la mise à jour d'Équipe.

source: Staff Deleted Successfully.
ar: تم حذف طاقم عمل بنجاح.
fr: Équipe supprimé avec succès.

source: Failed to Delete Staff.
ar: فشل في حذف طاقم العمل!
fr: Échec de la suppression d'Équipe.

source: Department Name
ar: اسم القسم
fr: Nom du département

source: Departments Details
fr: Détails des départements

source: Invalid Method!
ar: طريقة غير صحيحة!
fr: Identifiant Invalide!

source: Department Added Successfully!
ar: تمت إضافة القسم بنجاح!
fr: Département ajouté avec succès !

source: Failed to Add Department!
ar: فشل إضافة القسم!
fr: Échec d'ajouter département !

source: Department Updated Successfully.
ar: تم تحديث القسم بنجاح.
fr: Département mis à jour avec succès.

source: Failed to Update Department.
ar: فشل في تحديث القسم.
fr: Échec de la mise à jour du département .

source: Department Deleted Successfully.
ar: تم حذف القسم بنجاح.
fr: Département supprimé avec succès.

source: Failed to Delete Department.
ar: فشل في حذف القسم.
fr: Échec de supprimer le département .

source: Service Name
fr: Nom du service

source: Services Details
fr: Détails des services

source: Service Added Successfully!
fr: Service ajouté avec succès !

source: Failed to Add Service!
fr: Échec d'ajouter un Service!

source: Invalid Method.
ar: طريقة غير صحيحة
fr: Méthode invalide.

source: Service Updated Successfully.
fr: Mise à jour du Service réussie

source: Failed to Update Service.
fr: Échec de la mise à jour du Service.

source: Service Deleted Successfully.
fr: Service supprimé avec succès.

source: Failed to Delete Service.
fr: Échec de la suppression du service.

source: 'Invalid Method
ar: طريقة غير صحيحة
fr: 'Méthode invalide

source: Assignment Period added Successfully!
fr: Période de Mission ajouté avec succès !

source: Failed to Add Assignment Period
fr: Échec d'ajouter la Période de Mission!

source: Assignment Period Updated Successfully.
fr: Période de Mission mis à jour avec succès.

source: Failed to Update Assignment Period.
fr: Échec de la mise à jour de Période de Mission.

source: Assignment Period Deleted Successfully.
fr: Période de Mission supprimé avec succès

source: Failed to Delete Assignment Period.
fr: Échec de la suppression du Période de Mission.

source: First Name
ar: الاسم الأول
fr: Prenom

source: Last Name
ar: اسم العائلي
fr: Nom

source: Phone number
fr: Numéro de téléphone

source: Department
ar: قسم
fr: Département

source: Employees Details
fr: Détails des employés

source: Employee Added Successfully!
fr: Employé ajouté avec succès !

source: Failed to Add Employee!
fr: Échec d'ajouter un Employé!

source: Employee Updated Successfully!
fr: Employé mis à jour avec succès !

source: Failed to Update Employee.
fr: Échec de la mise à jour d'Employé.

source: Employee Deleted Successfully.
fr: Employé supprimé avec succès.

source: Failed to Delete Employee.
fr: Échec de la suppression d'Employé.

source: Assignment Name
ar: اسم المهمة
fr: Nom de Mission

source: Start Period
ar: سنة بدء التدريب
fr: début de période

source: End Period
ar: سنة نهاية التدريب
fr: fin de période

source: Staff
ar: طاقم عمل
fr: Équipe

source: Assignments Details
fr: Détails des Missions

source: to
ar: إلى
fr: à

source: Method Not Allowed!
ar: الطريقة غير متاحة!
fr: Méthode Non Autorisée!

source: Assignment Added Successfully!
ar: تمت إضافة المهمة بنجاح!
fr: Mission ajouté avec succès !

source: Failed to Add Assignment!
ar: فشل إضافة المهمة!
fr: Échec d'ajouter la Mission!

source: Assignment Updated Successfully.
ar: تم تحديث المهمة بنجاح.
fr: Mission mis à jour avec succès.

source: Failed to Update Assignment.
ar: فشل في تحديث المهمة.
fr: Échec de la mise à jour de Mission.

source: Assignment Deleted Successfully.
ar: تم حذف المهمة بنجاح.
fr: Mission supprimé avec succès

source: Failed to Delete Assignment.
ar: فشل في حذف المهمة.
fr: Échec de la suppression de Mission.

source: Message Reply
fr: Réponse aux messages

source: Sended On
ar: تم الإرسال في
fr: Envoyé le

source: Messages Apply by Employees
fr: Messages appliqués par les employés

source: Staff Name
ar: اسم طاقم العمل
fr: Nom d'Équipe

source: Messages Apply by Staffs
fr: Messages appliqués par les Équipes

source: Leave Date
ar: تاريخ المغادرة
fr: date de Cangé

source: Leave Message
ar: رسالة المغادرة
fr: message de Cangé

source: Approved
ar: طلب مقبول
fr: Approuvé

source: Rejected
ar: طلب مرفوض
fr: Rejeté

source: Pending
ar: قيد الانتظار
fr: En cours

source: Leaves Apply by Employees
fr: Congé appliqués par les employés

source: Leave Apply by Staffs
ar: طلب المغادرة لطاقم العمل
fr: Congé Appliquer par les Équipes

source: Full Name
fr: Nom complet

source: Present
ar: حاضر
fr: Présent

source: All Employees Attendance
fr: Présence de tous les employés

source: Employee Name
fr: Nom de l'employé

source: Total Days
fr: Total de jours

source: Total Present
fr: Présent total

source: Total Absent
fr: Absent total

source: Total Employees Attendance
fr: Présence totale des employés

source: Profile Updated Successfully
ar: تم تحديث الملف الشخصي بنجاح
fr: Mise à jour du profil réussie

source: Failed to Update Profile
ar: فشل في تحديث الملف الشخصي.
fr: Échec de la mise à jour du profil

source: Employee {emp} Attendance
fr: Présence d'Employé {emp}

source: Total {emp} Attendance
fr: Présence totale de {emp}

source: Leave Apply by Employee {emp}
fr: Demande de congé par employé {emp}

source: Applied for Leave.
ar: تم طلب الحصول على المغادرة.
fr: Demande de congé.

source: Failed to Apply Leave
ar: فشل في تقديم طلب المغادرة
fr: Échec de la demande de congé

source: Messages Apply by Employee {emp}
fr: Messages Appliquer par employé {emp}

source: Message Sent.
fr: Message envoyé.

source: Failed to Send Message.
fr: Échec de l'envoi du message.

source: Assignment
ar: مهمة
fr: Mission

source: Assignment Mark
ar: علامة المهمة :
fr: Marque de Mission

source: Bad Work
ar: عمل سيئة
fr: Mauvais travail

source: Normal Work
ar: عمل عادي
fr: Travail normal

source: Good Work
ar: عمل جيد
fr: Bon travail

source: Amazing Work
ar: عمل مدهش
fr: Excellent travail

source: wonderful Work
fr: Très bon travail

source: {emp} Evaluation Result
fr: Résultat de l'évaluation de {emp}

source: Leave Apply by Staff {staff}
fr: Congé Appliquer par l'Équipe {staff}

source: Messages Apply by Staff {staff}
fr: Messages Appliquer par l'Équipe {staff}

source: Employees Under {staff}
fr: Employés sous {staff}

source: Employees Attendance Under Staff {staff}
fr: Présence des employés sous l'équipe {staff}

source: Result Updated Successfully!
ar: تم تحديث النتيجة بنجاح!
fr: Résultat mis à jour avec succès !

source: Result Added Successfully!
ar: تمت إضافة النتيجة بنجاح!
fr: Résultat ajouté avec succès !

source: Failed to Add Result!
ar: فشل في إضافة النتيجة!
fr: Échec de l'ajout de résultat !

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Male
ar: ذكر
fr: Mâle

source: Female
ar: أنثى
fr: Femelle

source: Gender
ar: جنس
fr: Genre

source: Phone Number
fr: Numéro de téléphone

source: Enter your phone number
fr: Entrez votre numéro de téléphone

source: Assignment Period
fr: Période de Mission

source: Profile Pic
ar: صورة الملف الشخصي
fr: Photo de profil

source: address
ar: عنوان
fr: adresse

source: department name
ar: اسم القسم
fr: Nom de département

source: service name
fr: Nom du service

source: assignment name
ar: إسم المهمة
fr: nom de mission

source: gender
ar: جنس
fr: genre

source: profile picture
ar: الصوره الشخصيه
fr: Photo de profil

source: phone number
fr: numéro de téléphone

source: leave message
ar: رسالة المغادرة
fr: message de Cangé

source: leave date
ar: تاريخ مغادرة
fr: date de Cangé

source: feedback
ar: تعليق
fr: message

source: feedback reply
ar: الرد على التعليق
fr: Répondre au message

source: Province Management System | Dashboard
fr: Système de gestion des ressources humaines | Tableau de bord

source: Add Departement
ar: إضافة قسم
fr: Ajouter Département

source: Add Department
ar: إضافة قسم
fr: Ajouter Département

source: Enter Department
ar: أدخل القسم
fr: Entrée département

source: Add Assignment
ar: أضف مهمة
fr: Ajouter Mission

source: Enter Assignment
ar: أدخل المهمة
fr: Entrée Mission

source: Period
fr: Période

source: Add Employee
fr: Ajouter un employé

source: Email Not Available.
ar: البريد الإلكتروني غير متاح.
fr: E-mail non disponible.

source: Email Available.
ar: البريد الإلكتروني متاح.
fr: E-mail disponible.

source: Username Not Available.
ar: إسم المستخدم غير متاح.
fr: Nom d'utilisateur indisponible.

source: Username Available.
ar: إسم المستخدم متاح.
fr: Nom d'utilisateur disponible.

source: Add Service
fr: Ajouter Service

source: Service Name
fr: Nom du service

source: Enter Service
fr: Entrez le service

source: Add Assignment Period
fr: Ajouter une période de Mission

source: Add Period
ar: أضف فترة التدريب
fr: Ajouter Période

source: Add Staff
ar: إضافة طاقم العمل
fr: Ajouter Équipe

source: Email address
ar: عنوان البريد الإلكتروني
fr: Adresse e-mail

source: Enter email
ar: أدخل البريد الإلكتروني
fr: Entrée e-mail

source: Update Profile
ar: تحديث حساب تعريفي
fr: Mettre à jour le profil

source: Fill only if you want to change Password.
ar: املأ فقط إذا كنت تريد تغيير كلمة المرور.
fr: Remplissez uniquement si vous souhaitez modifier le mot de passe.

source: View Attendance
ar: عرض الحضور
fr: Voir la présence

source: Download PDF
fr: Télécharger le PDF

source: Internship Period
ar: فترة التدريب
fr: Période de Assignment

source: to
ar: إلى
fr: à

source: Fetch Attendance Date
ar: جلب تاريخ الحضور
fr: Récupérer la date de présence

source: Attendance Date
ar: تاريخ الحضور
fr: Date de présence

source: Fetch Intern Data
ar: جلب بيانات المتدرب
fr: Récupérer les données de Stagiaire

source: No Attendance Data Found.
ar: لم يتم العثور على بيانات الحضور.
fr: Aucune donnée de présence trouvée.

source: Error in getting Attendance Dates.
ar: خطأ في الحصول على تواريخ الحضور.
fr: Erreur lors de l'obtention des dates de présence.

source: Intern Attendance:
ar: حضور المتدرب:
fr: Présence du Stagiaire:

source: Error in Fetching Interns.
ar: خطأ في جلب المتدربين.
fr: Erreur lors de la récupération des Stagiaires.

source: Province Management System | Admin Dashboard
fr: Système de gestion des ressources humaines | Tableau de bord Administrateur

source: Province Management System | Admin
fr: Système de gestion des ressources humaines | Administrateur

source: Logout
ar: تسجيل خروج
fr: Se déconnecter

source: Home
ar: الرئسية
fr: Accueil

source: Edit Department | #ID : %(deptId)s
ar: تحرير القسم | #ID: %(deptId)s
fr: Modifier Département | #ID : %(deptId)s

source: Edit Department
ar: تحرير القسم
fr: Modifier Département

source: Update Department
ar: تحديث القسم
fr: Mise à jour Département

source: Edit Assignment | #ID : %(hedId)s
ar: تحرير المهمة | # ID: %(hedId)s
fr: Modifier la mission | #ID : %(hedId)s

source: Edit Assignment
ar: تحرير المهمة
fr: Modifier la Mission

source: Update Assignment
ar: تحديث المهمة
fr: Mise à jour Mission

source: Edit Employee | Username: %(usern)s | #ID : %(idU)s
fr: Modifier Employé | Nom d'utilisateur: %(usern)s | #ID : %(idU)s

source: Edit Employee
fr: Modifier Employé

source: Update Employee
fr: Mettre à jour l'Employé

source: Edit Service | #ID : %(servId)s
fr: Modifier Service | #ID : %(deptId)s

source: Edit Service
fr: Modifier Service

source: Update Service
fr: Mettre à jour le Service

source: Edit Internship Period Year
ar: تحرير سنة فترة التدريب
fr: Modifier l'année de la période de stage

source: Edit Period Year
ar: تحرير فترة التدريب
fr: Modifier l'année de la période

source: Period Start Year
ar: سنة بدء فترة التدريب
fr: Année début de période

source: Period End Year
ar: سنة نهاية فترة التدريب
fr: Année fin de période

source: Update Period Year
ar: تحديث سنة فترة التدريب
fr: Mettre à jour l'année de la période

source: Edit Staff | Username: %(sUnser)s | #ID : %(sId)s
ar: تحرير فريق العمل | اسم المستخدم: %(sUnser)s | #ID : %(sId)s
fr: Modifier Équipe | Nom d'utilisateur: %(sUnser)s | #ID : %(sId)s

source: Edit Staff
ar: تحرير طاقم العمل
fr: Modifier l'Équipe

source: Update Staff
ar: تحديث طاقم العمل
fr: Mettre à jour Équipe

source: All rights reserved.
ar: كل الحقوق محفوظة.
fr: Tous les droits sont réservés.

source: Enter First name
fr: Entrez votre prénom

source: Enter Last name
fr: Entrez votre nom

source: Enter Username
fr: Entrez Nom d'utilisateur

source: Enter Address
fr: Entrez Adresse

source: Total Employees
fr: Total des employés

source: More info
ar: مزيد من المعلومات
fr: Plus d'informations

source: Total Staffs
ar: إجمالي طاقم العمل
fr: Total des Équipes

source: Total Departments
ar: إجمالي الأقسام
fr: Total de Départements

source: Total Assignments
ar: إجمالي المهام
fr: Total de Missions

source: More info
ar: مزيد من المعلومات
fr: Plus d'informations

source: Employee and Staff Chart
fr: graphe des employés et des équipes

source: Total Assignments in Each Departement
ar: إجمالي المهام في كل قسم
fr: Total des Missions dans chaque Département

source: Total Employees in Each Department
fr: Total des employés dans chaque Département

source: Total Employees in Each Assignment
fr: Total des employés dans chaque Mission

source: Staff Attendance vs Leave
ar: حضور طاقم عمل مقابل المغادرة
fr: Présence d'équipe vs Congé

source: Employee Attendance vs Leave
fr: Présence d'employé vs Congé

source: Employees
fr: employés

source: Staffs
ar: طاقم العمل
fr: Équipes

source: Leave
ar: المغادرة
fr: Congé

source: Attendance
ar: الحضور
fr: Présence

source: Employees Message
fr: message des employés

source: Employee Message
fr: message d'employé

source: Employee
fr: employé

source: Reply
ar: الرد
fr: Répondre

source: Reply Message
fr: Message de réponse

source: Reply to:
ar: الرد على:
fr: Répondre à:

source: Sending Reply...
ar: إرسال الرد ...
fr: Envoi de la réponse...

source: Reply Sent!
ar: تم إرسال الرد!
fr: Réponse envoyée!

source: Failed to Send Reply!
ar: فشل في إرسال الرد!
fr: Échec de l'envoi de la réponse!

source: Error in Sending Message Reply.
fr: Erreur lors de l'envoi de la réponse au message.

source: Leave Apply by Employees
fr: Demande de congé par les employés

source: Applied On
ar: تم الطلب
fr: Appliqué sur

source: Approve
ar: موافقة
fr: Approuver

source: Reject
ar: رفض
fr: Rejeter

source: Manage Department
ar: إدارة القسم
fr: Gérer Département

source: + Add Department
ar: + اضافة قسم
fr: + Ajouter Département

source: Search
ar: بحث
fr: Recherche

source: Created At
ar: أنشئت في
fr: Créé à

source: Updated At
ar: تم التحديث في
fr: Mis à jour à

source: Edit
ar: تحرير
fr: Modifier

source: Delete
ar: حذف
fr: Supprimer

source: Manage Assignments
ar: إدارة المهام
fr: Gérer Missions

source: + Add Assignment
ar: + إضافة مهمة
fr: + Ajouter Mission

source: Assignment Details
ar: تفاصيل المهمة
fr: Détails de Mission

source: Started Period
fr: Période commencée

source: Manage Employee
fr: Gérer l'employé

source: + Add Employee
fr: + Ajouter un employé

source: Last Login
ar: آخر تسجيل دخول
fr: Dernière connexion

source: Date Joined
ar: تاريخ الانضمام
fr: Date Rejoint

source: Manage Services
fr: Gérer Services

source: + Add Service
fr: + Ajouter Service

source: Manage Assignments Period
fr: Gérer la période des Missions

source: + Add Period
ar: + اضافة فترة التدريب
fr: + Ajouter Période

source: Period Details
ar: تفاصيل فترة التدريب
fr: Détails de Période

source: Manage Staff
ar: إدارة طاقم العمل
fr: Gérer Équipe

source: + Add Staff
ar: + إضافة طاقم العمل
fr: + Ajouter Équipe

source: Staff Details
ar: تفاصيل طاقم العمل
fr: Détails d'Équipe

source: Manage Service
fr: Gérer Service

source: Manage Period
ar: إدارة فترة التدريب
fr: Gérer Période

source: Manage Assignment
ar: إدارة المهمة
fr: Gérer Mission

source: Staff Message
fr: Message Équipe

source: Employee Leave
fr: Congé employé

source: Staff Leave
ar: مغادرة طاقم العمل
fr: Congé Équipe

source: Employee Management System | Employee Dashboard
fr: Système de gestion des ressources humaines | Tableau de bord d'employé

source: Employee Management System | Employee
fr: Système de gestion des ressources humaines | Employé

source: Leave Report and Apply for Leave
ar: ترك تقرير والتقدم بطلب للحصول على المغادرة
fr: Rapport de congé et demande de congé

source: Apply For Leave
ar: تقدم بطلب للحصول على مغادرة
fr: Demander un congé

source: Leave Reason
ar: سبب المغادرة
fr: Raison de Cangé

source: Leave Messge
ar: رسالة المغادرة
fr: Message de Cangé

source: Apply for Leave
ar: تقدم بطلب للحصول على مغادرة
fr: Demander un congé

source: Leave Apply History
ar: سجل طلبات المغادرة
fr: Histoire de Congé Appliqués

source: Attendance Data for
ar: بيانات الحضور لـ
fr: Donées de présence pour

source: [ Status : Present ]
ar: [ الحالة : حاضر ]
fr: [ Statut : Présent ]

source: [ Status : Absent ]
ar: [ الحالة : غائب ]
fr: [ Statut : Absent ]

source: Feedback Message
ar: رسالة التعليق
fr: Message de Commentaire

source: Leave a Message
fr: Laisser un message

source: Message History
fr: Historique des messages

source: Employee Home
fr: Accueil des employés

source: Total Attendance
ar: إجمالي الحضور
fr: Total de présence

source: Total Attendance Chart
ar: مخطط إجمالي الحضور
fr: Graphe Total de présence

source: Attendance Statistics by Assignments
ar: إحصائيات الحضور حسب المهام
fr: Statistiques de présence par Mission

source: PRESENT
ar: حاضر
fr: PRÉSENT

source: Start Assignment Date
fr: Date de début de Mission

source: End Assignment Date
fr: Date de fin de Mission

source: Fetch Attendance
ar: جلب الحضور
fr: Récupérer la présence

source: View Assignments
ar: عرض المهام
fr: Voir les Missions

source: Result
ar: نتيجة
fr: Resultat

source: Assignments Marks
ar: علامة المهام
fr: Note de Missions

source: Wonderful Work
ar: عمل رائع
fr: Très bon travail

source: Error Up 20
ar: خطأ حتى 20
fr: Erreur jusqu'à 20

source: View Evaluation Result
ar: عرض نتيجة التقييم
fr: Voir résultat d'évaluation

source: Send Message
fr: Envoyer le message

source: Management System
ar: النظام الإداري
fr: Système de Gestion

source: Province
fr: Ressources Humaines

source: Sign in to Province Management System
fr: Connectez-vous au Système de gestion des ressources humaines

source: Sign In
ar: تسجيل الدخول
fr: S'identifier

source: Add Evaluation Result
ar: أضف نتيجة التقييم
fr: Ajouter résultat d'évaluation

source: Add Result
ar: أضف نتيجة
fr: Ajouter Resultat

source: Fetch Employee
fr: recupérer Employé

source: Employee List
fr: Liste des employés

source: Assignment Mark :
ar: علامة المهمة :
fr: Marque de Mission :

source: Exam Marks :
ar: علامة الإمتحان :
fr: Note Exam :

source: Exam Marks
ar: علامة الإمتحان :
fr: Note Exam

source: Save Result
ar: حفظ النتيجة
fr: Enregistrer Resultat

source: Error in Fetching Employees.
fr: Erreur lors de la récupération des employés

source: Province Management System | Staff Dashboard
fr: Système de gestion des ressources humaines | Tableau de bord d'équipe

source: Province Management System | Staff
fr: Système de gestion des ressources humaines | Équipe

source: Evaluation Result
ar: نتيجة التقييم
fr: Résultat de l'évaluation

source: View Employee
fr: Voir l'employé

source: Take Attendance
ar: تسجيل الحضور
fr: Prendre la présence

source: View Update Attendance
ar: عرض تحديث الحضور
fr: Voir mise-à-jour de présence

source: View Result
ar: عرض نتائج المهام
fr: Voir Resultat

source: Apply Leave
ar: تطبيق المغادرة
fr: Demander Congé

source: Staff Home
ar: الصفحة الرئيسية لطاقم العمل
fr: Accueil d'Équipe

source: Employees Under Me
fr: Employés sous moi

source: Total Attendance Taken
ar: إجمالي الحضور
fr: Total de présence

source: Total Leave Taken
ar: إجمالي المغادرأت
fr: Total de Congés

source: Leave Status Chart
ar: مبيان حالات المغادرة
fr: Graphe des Status de Congé

source: Assignments Attend Chart
ar: مبيان الحضور للمهام
fr: Graphe de Présence aux Missions

source: Employee Attendance Data
fr: Données de présence des employés

source: Assignment Attend Chart
ar: مبيان الحضور للمهام
fr: Graphe de Présence aux Missions

source: Employee Attendance Chart for Present
fr: Graphe de Présence des employés pour le présent

source: Employee Attendance Chart for Absent
fr: Graphe de présence des employés pour absence

source: Attendance Date:
ar: تاريخ الحضور:
fr: Date de Présence

source: Save Attendance Data
ar: حفظ بيانات الحضور
fr: Enregistrer les données de présence

source: Saving Attendance Data...
ar: حفظ بيانات الحضور ...
fr: Enregistrement Données de Présence...

source: Attendance Saved!
ar: تم حفظ الحضور!
fr: Présence enregistrée !

source: Failed to Save Attendance!
ar: فشل في حفظ الحضور!
fr: Échec d'enregistrer de la Présence!

source: Error in Saving Employees Attendance Data.
fr: Erreur lors de l'enregistrement des données de présence des employés.

source: Attendance Date
ar: تاريخ الحضور
fr: Date de présence

source: Fetch Employee Data
fr: Récupérer les données d'employé

source: Employee Attendance:
fr: Présence des employés :

source: Employee Details
fr: Détails de l'employé

source: doLogin/
fr: SeConnecter/

source: get_user_details/
fr: obtenir_détails_utilisateur/

source: logout_user/
fr: déconnexion_utilisateur/

source: admin_home/
fr: accueil_administrateur/

source: admin_profile/
fr: profile_administrateur/

source: admin_profile_update/
fr: miseAjour_profile_administrateur/

source: add_staff/
fr: ajouter_equipe/

source: manage_staff/
fr: gérer_équipe/

source: add_staff_save/
fr: ajouter_equipe_enregistrer/

source: edit_staff/<staff_id>/
fr: modifier_equipe/<staff_id>/

source: edit_staff_save/
fr: modifier_equipe_enregistrer/

source: delete_staff/<staff_id>/
fr: supprimer_equipe/<staff_id>/

source: generate_staff_pdf/
fr: gérer_équipe_pdf/

source: add_department/
fr: ajouter_departement/

source: add_department_save/
fr: ajouter_departement_enregistrer/

source: manage_department/
fr: gérer_département/

source: edit_department/<department_id>/
fr: modifier_departement/<department_id>/

source: edit_department_save/
fr: modifier_departement_enregistrer/

source: delete_department/<department_id>/
fr: supprimer_departement/<department_id>/

source: generate_department_pdf/
fr: générer_département_pdf/

source: manage_service/
fr: gerer_service/

source: add_service/
fr: ajouter_service/

source: add_service_save/
fr: ajouter_service_enregistrer/

source: edit_service/<service_id>
fr: modifier_service/<service_id>

source: edit_service_save/
fr: modifier_service_enregistrer/

source: delete_service/<service_id>/
fr: supprimer_service/<service_id>/

source: generate_service_pdf/
fr: gérer_service_pdf/

source: manage_session/
fr: gerer_session/

source: add_session/
fr: ajouter_session/

source: add_session_save/
fr: ajouter_session_enregistrer/

source: edit_session/<session_id>
fr: modifier_session/<session_id>

source: edit_session_save/
fr: modifier_session_enregistrer/

source: delete_session/<session_id>/
fr: supprimer_session/<session_id>/

source: manage_intern/
fr: gerer_employé/

source: add_intern/
fr: ajouter_employé/

source: add_intern_save/
fr: ajouter_stagiaire_employé/

source: edit_intern/<intern_id>
fr: modifier_employé/<intern_id>
